// --------------------------------------------------------------------------
// 📌 [함수형 프로그래밍 펀더멘탈]
// --------------------------------------------------------------------------
// 1. 챕터(chapters)
// 2. 미션(missions)
// --------------------------------------------------------------------------

// 웹 표준: 파일 확장자가 필요
// Vite 환경: 파일 확장자 생략 가능 (.js, .jsx, .ts, .tsx, .json)


// import './styles/main.css';
// import './FP/chapters/00-programming-paradigm';
import './FP/chapters/01-functional-principle';